/**			                                                    
		   ____                    _____ _______ _____       @塔克创新
		  / __ \                  / ____|__   __|  __ \ 
		 | |  | |_ __   ___ _ __ | |       | |  | |__) |
		 | |  | | '_ \ / _ \ '_ \| |       | |  |  _  / 
		 | |__| | |_) |  __/ | | | |____   | |  | | \ \ 
		  \____/| .__/ \___|_| |_|\_____|  |_|  |_|  \_\
				| |                                     
				|_|                OpenCTR   机器人控制器
									 
  ****************************************************************************** 
  *           
  * 版权所有： @塔克创新  版权所有，盗版必究
  * 公司网站： www.xtark.cn   www.tarkbot.com
  * 淘宝店铺： https://xtark.taobao.com  
  * 塔克微信： 塔克创新（关注公众号，获取最新更新资讯）
  *      
  ******************************************************************************
  * @作  者  Musk Han@XTARK
  * @内  容  系统配置相关
  *
  ******************************************************************************
  * @说  明
  *
  * 1.JTAG SWD设置
  * 
  ******************************************************************************
  */

#include "ax_sys.h"

/**
  * @简  述  JTAG模式设置
  * @参  数  mode:jtag,swd模式设置;00,全使能;01,使能SWD;10,全关闭;  
						JTAG_SWD_DISABLE   0X02
						SWD_ENABLE         0X01
						JTAG_SWD_ENABLE    0X00	
  * @返回值  无
  */
void AX_JTAG_Set(uint8_t mode)
{
	uint32_t temp;
	
	temp=mode;
	temp<<=25;
	RCC->APB2ENR|=1<<0;     //开启辅助时钟	   
	AFIO->MAPR&=0XF8FFFFFF; //清除MAPR的[26:24]
	AFIO->MAPR|=temp;       //设置jtag模式
} 

/******************* (C) 版权 2023 XTARK **************************************/
